###################################################################

# Created by write_sdc on Thu Jul  7 16:42:43 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports READY]
set_load -pin_load 3.40189 [get_ports DONE]
set_load -pin_load 3.40189 [get_ports {MVP0[21]}]
set_load -pin_load 3.40189 [get_ports {MVP0[20]}]
set_load -pin_load 3.40189 [get_ports {MVP0[19]}]
set_load -pin_load 3.40189 [get_ports {MVP0[18]}]
set_load -pin_load 3.40189 [get_ports {MVP0[17]}]
set_load -pin_load 3.40189 [get_ports {MVP0[16]}]
set_load -pin_load 3.40189 [get_ports {MVP0[15]}]
set_load -pin_load 3.40189 [get_ports {MVP0[14]}]
set_load -pin_load 3.40189 [get_ports {MVP0[13]}]
set_load -pin_load 3.40189 [get_ports {MVP0[12]}]
set_load -pin_load 3.40189 [get_ports {MVP0[11]}]
set_load -pin_load 3.40189 [get_ports {MVP0[10]}]
set_load -pin_load 3.40189 [get_ports {MVP0[9]}]
set_load -pin_load 3.40189 [get_ports {MVP0[8]}]
set_load -pin_load 3.40189 [get_ports {MVP0[7]}]
set_load -pin_load 3.40189 [get_ports {MVP0[6]}]
set_load -pin_load 3.40189 [get_ports {MVP0[5]}]
set_load -pin_load 3.40189 [get_ports {MVP0[4]}]
set_load -pin_load 3.40189 [get_ports {MVP0[3]}]
set_load -pin_load 3.40189 [get_ports {MVP0[2]}]
set_load -pin_load 3.40189 [get_ports {MVP0[1]}]
set_load -pin_load 3.40189 [get_ports {MVP0[0]}]
set_load -pin_load 3.40189 [get_ports {MVP1[21]}]
set_load -pin_load 3.40189 [get_ports {MVP1[20]}]
set_load -pin_load 3.40189 [get_ports {MVP1[19]}]
set_load -pin_load 3.40189 [get_ports {MVP1[18]}]
set_load -pin_load 3.40189 [get_ports {MVP1[17]}]
set_load -pin_load 3.40189 [get_ports {MVP1[16]}]
set_load -pin_load 3.40189 [get_ports {MVP1[15]}]
set_load -pin_load 3.40189 [get_ports {MVP1[14]}]
set_load -pin_load 3.40189 [get_ports {MVP1[13]}]
set_load -pin_load 3.40189 [get_ports {MVP1[12]}]
set_load -pin_load 3.40189 [get_ports {MVP1[11]}]
set_load -pin_load 3.40189 [get_ports {MVP1[10]}]
set_load -pin_load 3.40189 [get_ports {MVP1[9]}]
set_load -pin_load 3.40189 [get_ports {MVP1[8]}]
set_load -pin_load 3.40189 [get_ports {MVP1[7]}]
set_load -pin_load 3.40189 [get_ports {MVP1[6]}]
set_load -pin_load 3.40189 [get_ports {MVP1[5]}]
set_load -pin_load 3.40189 [get_ports {MVP1[4]}]
set_load -pin_load 3.40189 [get_ports {MVP1[3]}]
set_load -pin_load 3.40189 [get_ports {MVP1[2]}]
set_load -pin_load 3.40189 [get_ports {MVP1[1]}]
set_load -pin_load 3.40189 [get_ports {MVP1[0]}]
set_load -pin_load 3.40189 [get_ports {MVP2[21]}]
set_load -pin_load 3.40189 [get_ports {MVP2[20]}]
set_load -pin_load 3.40189 [get_ports {MVP2[19]}]
set_load -pin_load 3.40189 [get_ports {MVP2[18]}]
set_load -pin_load 3.40189 [get_ports {MVP2[17]}]
set_load -pin_load 3.40189 [get_ports {MVP2[16]}]
set_load -pin_load 3.40189 [get_ports {MVP2[15]}]
set_load -pin_load 3.40189 [get_ports {MVP2[14]}]
set_load -pin_load 3.40189 [get_ports {MVP2[13]}]
set_load -pin_load 3.40189 [get_ports {MVP2[12]}]
set_load -pin_load 3.40189 [get_ports {MVP2[11]}]
set_load -pin_load 3.40189 [get_ports {MVP2[10]}]
set_load -pin_load 3.40189 [get_ports {MVP2[9]}]
set_load -pin_load 3.40189 [get_ports {MVP2[8]}]
set_load -pin_load 3.40189 [get_ports {MVP2[7]}]
set_load -pin_load 3.40189 [get_ports {MVP2[6]}]
set_load -pin_load 3.40189 [get_ports {MVP2[5]}]
set_load -pin_load 3.40189 [get_ports {MVP2[4]}]
set_load -pin_load 3.40189 [get_ports {MVP2[3]}]
set_load -pin_load 3.40189 [get_ports {MVP2[2]}]
set_load -pin_load 3.40189 [get_ports {MVP2[1]}]
set_load -pin_load 3.40189 [get_ports {MVP2[0]}]
set_load -pin_load 3.40189 [get_ports cComp_EN]
set_load -pin_load 3.40189 [get_ports {D_Cur[27]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[26]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[25]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[24]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[23]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[22]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[21]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[20]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[19]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[18]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[17]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[16]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[15]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[14]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[13]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[12]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[11]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[10]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[9]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[8]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[7]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[6]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[5]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[4]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[3]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[2]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[1]}]
set_load -pin_load 3.40189 [get_ports {D_Cur[0]}]
create_clock [get_ports clk]  -name MY_CLK  -period 2.82  -waveform {0 1.41}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports clk]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_h[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_h[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_h[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_h[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_h[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_h[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_h[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_W[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_W[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_W[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_W[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_W[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_W[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CU_W[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports START]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports GOT]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports CU_RST]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports READY]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DONE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP0[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP1[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MVP2[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports cComp_EN]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[27]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[26]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[25]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[24]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[23]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[22]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {D_Cur[0]}]
