###################################################################

# Created by write_sdc on Wed Jul  6 21:44:14 2022

###################################################################
set sdc_version 2.1

set_units -time ns -resistance MOhm -capacitance fF -voltage V -current mA
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[12]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[11]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[10]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[9]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[8]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[7]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[6]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[5]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[4]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[3]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[2]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[1]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_x[0]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[12]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[11]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[10]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[9]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[8]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[7]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[6]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[5]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[4]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[3]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[2]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[1]}]
set_load -pin_load 3.40189 [get_ports {RADDR_RefCu_y[0]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_x[5]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_x[4]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_x[3]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_x[2]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_x[1]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_x[0]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_y[5]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_y[4]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_y[3]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_y[2]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_y[1]}]
set_load -pin_load 3.40189 [get_ports {RADDR_CurCu_y[0]}]
set_load -pin_load 3.40189 [get_ports MEM_RE]
set_load -pin_load 3.40189 [get_ports extimator_READY]
set_load -pin_load 3.40189 [get_ports GOT]
set_load -pin_load 3.40189 [get_ports {MV0_out[21]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[20]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[19]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[18]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[17]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[16]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[15]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[14]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[13]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[12]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[11]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[10]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[9]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[8]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[7]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[6]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[5]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[4]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[3]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[2]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[1]}]
set_load -pin_load 3.40189 [get_ports {MV0_out[0]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[21]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[20]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[19]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[18]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[17]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[16]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[15]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[14]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[13]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[12]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[11]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[10]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[9]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[8]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[7]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[6]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[5]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[4]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[3]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[2]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[1]}]
set_load -pin_load 3.40189 [get_ports {MV1_out[0]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[21]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[20]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[19]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[18]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[17]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[16]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[15]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[14]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[13]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[12]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[11]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[10]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[9]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[8]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[7]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[6]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[5]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[4]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[3]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[2]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[1]}]
set_load -pin_load 3.40189 [get_ports {MV2_out[0]}]
set_load -pin_load 3.40189 [get_ports DONE]
set_load -pin_load 3.40189 [get_ports eComp_EN]
set_load -pin_load 3.40189 [get_ports {CurSAD[17]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[16]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[15]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[14]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[13]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[12]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[11]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[10]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[9]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[8]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[7]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[6]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[5]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[4]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[3]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[2]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[1]}]
set_load -pin_load 3.40189 [get_ports {CurSAD[0]}]
set_load -pin_load 3.40189 [get_ports last_block_x]
set_load -pin_load 3.40189 [get_ports last_block_y]
set_load -pin_load 3.40189 [get_ports last_cand]
set_load -pin_load 3.40189 [get_ports Second_ready]
set_load -pin_load 3.40189 [get_ports CountTerm_OUT]
set_load -pin_load 3.40189 [get_ports INTER_DATA_VALID_SET]
set_load -pin_load 3.40189 [get_ports INTER_DATA_VALID_RESET]
set_load -pin_load 3.40189 [get_ports ADD3_MVin_LE_fSET]
set_load -pin_load 3.40189 [get_ports ADD3_MVin_LE_nSET]
set_load -pin_load 3.40189 [get_ports ADD3_MVin_LE_fRESET]
set_load -pin_load 3.40189 [get_ports LE_ab]
set_load -pin_load 3.40189 [get_ports SAD_tmp_RST]
set_load -pin_load 3.40189 [get_ports Comp_EN]
set_load -pin_load 3.40189 [get_ports OUT_LE]
set_load -pin_load 3.40189 [get_ports CountTerm_EN]
set_load -pin_load 3.40189 [get_ports CandCount_CE]
set_load -pin_load 3.40189 [get_ports RF_in_RE]
set_load -pin_load 3.40189 [get_ports BestCand]
set_load -pin_load 3.40189 [get_ports MULT1_VALID]
set_load -pin_load 3.40189 [get_ports ADD3_VALID]
set_load -pin_load 3.40189 [get_ports incrY]
set_load -pin_load 3.40189 [get_ports ADD3_MVin_LE]
set_load -pin_load 3.40189 [get_ports {eCU_PS[4]}]
set_load -pin_load 3.40189 [get_ports {eCU_PS[3]}]
set_load -pin_load 3.40189 [get_ports {eCU_PS[2]}]
set_load -pin_load 3.40189 [get_ports {eCU_PS[1]}]
set_load -pin_load 3.40189 [get_ports {eCU_PS[0]}]
set_load -pin_load 3.40189 [get_ports {eCU_NS[4]}]
set_load -pin_load 3.40189 [get_ports {eCU_NS[3]}]
set_load -pin_load 3.40189 [get_ports {eCU_NS[2]}]
set_load -pin_load 3.40189 [get_ports {eCU_NS[1]}]
set_load -pin_load 3.40189 [get_ports {eCU_NS[0]}]
create_clock [get_ports clk]  -name MY_CLK  -period 2.17  -waveform {0 1.085}
set_clock_uncertainty 0.07  [get_clocks MY_CLK]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports clk]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports VALID_VTM]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports VALID_CONST]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_in[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_in[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_in[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_h[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_h[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_h[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_h[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_h[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_h[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_h[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_w[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_w[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_w[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_w[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_w[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_w[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurCU_w[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports sixPar]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports CU_RST]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {RefPel[0]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[31]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[30]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[29]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[28]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[27]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[26]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[25]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[24]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[23]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[22]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[21]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[20]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[19]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[18]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[17]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[16]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[15]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[14]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[13]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[12]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[11]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[10]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[9]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[8]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[7]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[6]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[5]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[4]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[3]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[2]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[1]}]
set_input_delay -clock MY_CLK  -max 0.5  [get_ports {CurPel[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_x[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_RefCu_y[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_x[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_x[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_x[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_x[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_x[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_x[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_y[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_y[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_y[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_y[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_y[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {RADDR_CurCu_y[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MEM_RE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports extimator_READY]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports GOT]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV0_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV1_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[21]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[20]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[19]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[18]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {MV2_out[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports DONE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports eComp_EN]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[17]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[16]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[15]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[14]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[13]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[12]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[11]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[10]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[9]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[8]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[7]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[6]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[5]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {CurSAD[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports last_block_x]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports last_block_y]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports last_cand]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports Second_ready]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports CountTerm_OUT]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports INTER_DATA_VALID_SET]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports INTER_DATA_VALID_RESET]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports ADD3_MVin_LE_fSET]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports ADD3_MVin_LE_nSET]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports ADD3_MVin_LE_fRESET]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports LE_ab]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports SAD_tmp_RST]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports Comp_EN]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports OUT_LE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports CountTerm_EN]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports CandCount_CE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports RF_in_RE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports BestCand]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports MULT1_VALID]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports ADD3_VALID]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports incrY]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports ADD3_MVin_LE]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_PS[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_PS[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_PS[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_PS[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_PS[0]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_NS[4]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_NS[3]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_NS[2]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_NS[1]}]
set_output_delay -clock MY_CLK  -max 0.5  [get_ports {eCU_NS[0]}]
